Problem 1

The accompanying data set contains three numerical variables, x1, x2, and x3.

In [1]:
# load data (remember to upload the datafile you downloaded from connect to colab)
import pandas as pd
myData = pd.read_excel('Ch2_Q9_V19_Data_File.xlsx')
myData

    Observation    x1     x2     x3
0             1  33.0  371.0  189.0
1             2  28.0  752.0    NaN
2             3  24.0  673.0  204.0
3             4  17.0    NaN  151.0
4             5  20.0   66.0  191.0
..          ...   ...    ...    ...
86           87  18.0  412.0  137.0
87           88  28.0  629.0  139.0
88           89  22.0  167.0  125.0
89           90  35.0  842.0  126.0
90           91  38.0  180.0  151.0

[91 rows x 4 columns]

a. How many observations have x1 values greater than 30?

In [ ]:
# you can put .count() at the and of your query
myData.query("x1 > 30").count()

b. Sort the data by x1, x2, and then x3 all in ascending order. What are the x1, x2, and x3 values of the first observation after the data are sorted?

In [ ]:
myData.sort_values(['x1','x2','x3'], ascending = True) # observation 44

c. Sort the data by x1 and x2 both in descending order. What are the x1, x2, and x3 values of the first observation after the data are sorted?

In [ ]:
myData.sort_values(['x1','x2'], ascending=False)

d. How many missing values are there in x1, x2, and x3?

In [ ]:
myData.isna().sum()

Problem 2.

The following table lists a portion of the average writing and math SAT scores for the 50 states as well as the District of Columbia, Puerto Rico, and the U.S. Virgin Islands for the year 2017 as reported by the College Board.

In [ ]:
# Load data
import  pandas as pd
myData1 = pd.read_excel('Ch2_Q11_V10_Data_File.xlsx')

myData1

a. Sort the data by writing scores in descending order. Which state has the highest average writing score? What is the average math score of that state?

In [7]:
myData1.sort_values('Writing', ascending=False)

                   State  Writing  Math
15                  Iowa      600   545
24           Mississippi      599   576
14               Indiana      599   543
7               Delaware      592   583
12                 Idaho      588   536
27              Nebraska      588   586
23             Minnesota      586   600
52               Wyoming      584   516
3               Arkansas      583   509
43             Tennessee      582   564
25              Missouri      580   574
37                Oregon      577   542
39           Puerto Rico      575   567
9                Florida      573   534
11                Hawaii      571   577
32              New York      571   519
22              Michigan      566   542
40          Rhode Island      566   526
8   District of Columbia      562   558
44                 Texas      562   522
33        North Carolina      560   575
41        South Carolina      558   555
51             Wisconsin      553   592
42          South Dakota      553   562
34          North Dakota      553   551
2                Arizona      553   625
20              Maryland      552   592
31            New Mexico      549   589
48              Virginia      547   565
28                Nevada      542   527
5               Colorado      539   552
47        Virgin Islands      538   561
16                Kansas      538   540
29         New Hampshire      537   519
38          Pennsylvania      535   582
18             Louisiana      535   529
46               Vermont      534   564
13              Illinois      527   550
36              Oklahoma      526   502
6            Connecticut      525   524
4             California      524   513
49            Washington      522   502
10               Georgia      520   592
17              Kentucky      520   573
30            New Jersey      520   559
35                  Ohio      518   507
45                  Utah      517   581
21         Massachusetts      515   556
19                 Maine      514   593
50         West Virginia      512   569
26               Montana      512   520
0                Alabama      203   701
1                 Alaska      202   528

b. Sort the data by math scores in ascending order. Which state has the lowest average math score? What is the average writing score of that state?

In [9]:
myData1.sort_values('Math')

                   State  Writing  Math
49            Washington      522   502
36              Oklahoma      526   502
35                  Ohio      518   507
3               Arkansas      583   509
4             California      524   513
52               Wyoming      584   516
32              New York      571   519
29         New Hampshire      537   519
26               Montana      512   520
44                 Texas      562   522
6            Connecticut      525   524
40          Rhode Island      566   526
28                Nevada      542   527
1                 Alaska      202   528
18             Louisiana      535   529
9                Florida      573   534
12                 Idaho      588   536
16                Kansas      538   540
37                Oregon      577   542
22              Michigan      566   542
14               Indiana      599   543
15                  Iowa      600   545
13              Illinois      527   550
34          North Dakota      553   551
5               Colorado      539   552
41        South Carolina      558   555
21         Massachusetts      515   556
8   District of Columbia      562   558
30            New Jersey      520   559
47        Virgin Islands      538   561
42          South Dakota      553   562
46               Vermont      534   564
43             Tennessee      582   564
48              Virginia      547   565
39           Puerto Rico      575   567
50         West Virginia      512   569
17              Kentucky      520   573
25              Missouri      580   574
33        North Carolina      560   575
24           Mississippi      599   576
11                Hawaii      571   577
45                  Utah      517   581
38          Pennsylvania      535   582
7               Delaware      592   583
27              Nebraska      588   586
31            New Mexico      549   589
20              Maryland      552   592
10               Georgia      520   592
51             Wisconsin      553   592
19                 Maine      514   593
23             Minnesota      586   600
2                Arizona      553   625
0                Alabama      203   701

c. How many states reported an average math score higher than 600?

In [16]:
# remember to put .count() at the end
myData1.query("Math > 600")

     State  Writing  Math
0  Alabama      203   701
2  Arizona      553   625

d. How many states reported an average writing score lower than 550?

In [15]:
myData1.query("Writing < 550").count()

(26, 3)

Problem 3

Consider the information on annual income (Income in $1,000s), age, sex (F = female, M = male), and marital status (Married; Y = yes, N = no). A portion of the data is shown in the accompanying table.

In [25]:
# Load data
import pandas as pd 

myData2 = pd.read_excel('Ch2_Q14_Data_File.xlsx')
myData2

     Individual  Income  Age Sex Married
0           272     147   55   M       Y
1           364     140   52   M       Y
2           514     140   54   M       N
3           476     138   56   F       Y
4           641     130   45   M       N
..          ...     ...  ...  ..     ...
885         880      32   26   F       N
886         884      32   24   F       Y
887         457      31   26   F       Y
888         402      28   24   F       N
889         694      22   26   F       N

[890 rows x 5 columns]

a. Count the number of males and females in the data.

In [26]:
myData2.query("Sex == 'M'").count()

Individual    508
Income        508
Age           508
Sex           508
Married       508
dtype: int64

In [27]:
myData2.query("Sex == 'F'").count()

Individual    382
Income        382
Age           382
Sex           382
Married       382
dtype: int64

b. What percentage of males and females are married?

In [38]:
# you can count the numerator and the denominator separately and just divide the two numbers
myData2.query("Sex == 'M'").count()
round((myData2.query("Married == 'Y' & Sex == 'M'").count() / 508),2)

Individual    0.66
Income        0.66
Age           0.66
Sex           0.66
Married       0.66
dtype: float64

In [37]:
myData2.query("Sex == 'F'").count()
round((myData2.query("Married == 'Y' & Sex == 'F'").count()) / 382, 2)

Individual    0.65
Income        0.65
Age           0.65
Sex           0.65
Married       0.65
dtype: float64

c. Of the 10 individuals with the highest income, how many are married males?

In [49]:
# Isolate top 10 income individuals and assign it to a new dataset (e.g.: top10_income = ...)
# top10_Mincome = myData2[(myData2.Sex == 'M') & (myData2.Married == 'Y')].sort_values('Income', ascending=False).head(10)
# top10_Mincome

top10_income = myData2.sort_values('Income',ascending=False).head(10)
top10_income

   Individual  Income  Age Sex Married
0         272     147   55   M       Y
2         514     140   54   M       N
1         364     140   52   M       Y
3         476     138   56   F       Y
4         641     130   45   M       N
5         390     129   55   M       Y
6         623     128   53   M       Y
7         626     128   56   M       Y
8         675     126   55   M       Y
9         858     126   52   M       Y

In [50]:
# Subset for married and male from isolated dataset and count  ( put .count() at the end of query)
top10_income.query("Sex == 'M' & Married == 'Y'").count()

Individual    7
Income        7
Age           7
Sex           7
Married       7
dtype: int64

In [53]:
# Do a subet for unmarried males
top10_income.query("Sex == 'M' & Married == 'N'")

   Individual  Income  Age Sex Married
2         514     140   54   M       N
4         641     130   45   M       N

d. What are the highest and the lowest incomes of males and females?

In [56]:
# YOu can create sorted tables and read off the values
male = myData2.query("Sex == 'M'")
male

     Individual  Income  Age Sex Married
0           272     147   55   M       Y
1           364     140   52   M       Y
2           514     140   54   M       N
4           641     130   45   M       N
5           390     129   55   M       Y
..          ...     ...  ...  ..     ...
871         846      41   25   M       Y
873         732      40   24   M       Y
874         180      39   25   M       N
875         379      39   29   M       Y
882         399      35   25   M       Y

[508 rows x 5 columns]

In [58]:
female = myData2.query("Sex == 'F'")
female

     Individual  Income  Age Sex Married
3           476     138   56   F       Y
12          375     124   54   F       Y
26          305     120   55   F       N
33          830     119   52   F       Y
37          335     118   55   F       Y
..          ...     ...  ...  ..     ...
885         880      32   26   F       N
886         884      32   24   F       Y
887         457      31   26   F       Y
888         402      28   24   F       N
889         694      22   26   F       N

[382 rows x 5 columns]

In [60]:
male.sort_values('Income').head(1)

   Individual  Income  Age Sex Married
0         272     147   55   M       Y

In [62]:
male.sort_values('Income').tail(1)

   Individual  Income  Age Sex Married
0         272     147   55   M       Y

In [63]:
female.sort_values('Income').head(1)

     Individual  Income  Age Sex Married
889         694      22   26   F       N

In [64]:
female.sort_values('Income').tail(1)

   Individual  Income  Age Sex Married
3         476     138   56   F       Y

e. What are the highest and lowest incomes of married and unmarried males?

In [65]:
marriedMales = myData2.query("Sex == 'M' & Married == 'Y'")
marriedMales.head(1)

   Individual  Income  Age Sex Married
0         272     147   55   M       Y

In [66]:
marriedMales.tail(1)

     Individual  Income  Age Sex Married
882         399      35   25   M       Y

In [67]:
unmarriedMales = myData2.query("Sex == 'M' & Married == 'N'")
unmarriedMales.head(1)

   Individual  Income  Age Sex Married
2         514     140   54   M       N

In [68]:
unmarriedMales.tail(1)

     Individual  Income  Age Sex Married
874         180      39   25   M       N